# DataFrames

In [2]:
import pandas as pd

In [4]:
data = { 'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'], 'Age': [25, 30, 35, 40, 45], 'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Operations'] }
df = pd.DataFrame(data)
df

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

# Retrieve the row of the DataFrame where the Name is 'Charlie'.

In [5]:
df.loc[df['Name'] == 'Charlie']

      Name  Age Department
2  Charlie   35    Finance

# Select all the rows where the Age is greater than 30 using loc.

In [6]:
df.loc[df['Age'] > 30]

      Name  Age  Department
2  Charlie   35     Finance
3    David   40   Marketing
4      Eve   45  Operations

# Extract the third row of the DataFrame using iloc.

In [7]:
df.iloc[2]

Name          Charlie
Age                35
Department    Finance
Name: 2, dtype: object

# Using iloc, select the first three rows and only the Name and Age columns.

In [8]:

df.iloc[:3, [0,1]]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

# Change the Age of 'David' to 42 using loc.

In [10]:
df.loc[df['Name'] == 'David', 'Age'] = 42
df

      Name  Age  Department
0    Alice   25          HR
1      Bob   30          IT
2  Charlie   35     Finance
3    David   42   Marketing
4      Eve   45  Operations

# Update the Department of all employees who are in the 'IT' department to 'Tech Support'.

In [11]:
df.loc[df['Department'] == 'IT', 'Department'] = 'Tech Support'
df

      Name  Age    Department
0    Alice   25            HR
1      Bob   30  Tech Support
2  Charlie   35       Finance
3    David   42     Marketing
4      Eve   45    Operations

# Use iloc to update the Age of the second row to 32.

In [12]:
df.iloc[1, 1] = 32
df

      Name  Age    Department
0    Alice   25            HR
1      Bob   32  Tech Support
2  Charlie   35       Finance
3    David   42     Marketing
4      Eve   45    Operations

# Change the value of the Department in the first row to 'Admin' using iloc.

In [13]:
df.iloc[0, 2] = 'Admin'
df

      Name  Age    Department
0    Alice   25         Admin
1      Bob   32  Tech Support
2  Charlie   35       Finance
3    David   42     Marketing
4      Eve   45    Operations